## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [1]:
import pandas as pd

In [2]:
# загружаем датасет
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [3]:
# your code

m_w_count = data['sex'].value_counts()

m_w_count

Male      21790
Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [4]:
# your code
avg_male_age = data[data['sex'] == 'Male'].age.mean().round(0)

avg_male_age

39.0

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [5]:
# your code

american_part = (data['native-country'].value_counts(normalize = True)['United-States']).round(3)

american_part

0.896

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [30]:
# your code
age_sal_data    = data[['age','salary']]

avg_age_below50 = age_sal_data[age_sal_data['salary'] == '<=50K'].age.mean().round(0)
avg_age_above50 = age_sal_data[age_sal_data['salary'] == '>50K'].age.mean().round(0)

std_age_below50 = round(age_sal_data[age_sal_data['salary'] == '<=50K'].age.std(), 0)
std_age_above50 = round(age_sal_data[age_sal_data['salary'] == '>50K'].age.std(), 0)

print('mean for <=50K:', avg_age_below50,'mean for >50K:',avg_age_above50)
print('std for <=50K:',std_age_below50,'std for >50K:',std_age_above50)

mean for <=50K: 37.0 mean for >50K: 44.0
std for <=50K: 14.0 std for >50K: 11.0

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [53]:
# your code
education_sal_data = data[['salary', 'education']].query("salary == '>50K'")

educat = ['Bachelors','Prof-school',
          'Assoc-acdm','Assoc-voc',
          'Masters','Doctorate']

result = education_sal_data['education'] \
.isin(educat) \
.value_counts()

print('Утверждение ложно, так как\n', result)

Утверждение ложно, так как
 True     4535
False    3306
Name: education, dtype: int64

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [80]:
# your code

grouped_data = data.groupby(['race','sex'])['age'].describe()

grouped_data.loc[('Asian-Pac-Islander', 'Male'), 'max']

90.0

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [91]:
# your code

reach_data = data[['salary', 'marital-status']].query("salary == '>50K'")

reach_data['is_married'] = data['marital-status'].str.startswith('Married')

reach_data.is_married.value_counts(normalize = True)

True     0.859074
False    0.140926
Name: is_married, dtype: float64

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [117]:
# your code
max_hour       = data['hours-per-week'].max()

df             = data[data['hours-per-week'] == max_hour]

person_99h_cnt = df.age.count()

reach_percent  = round(float(df.salary \
.value_counts(normalize = True) \
.reset_index() \
.query("index == '>50K'") \
.salary.values) * 100, 1)

print(f"\n Максимальное кол-во часов = {max_hour} \n Кол-во людей, работающих {max_hour} часов = {person_99h_cnt}\n Процент богатых = {reach_percent}")

 Максимальное кол-во часов = 99
 Кол-во людей, работающих 99 часов = 85
 Процент богатых = 29.4

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [126]:
# your code

avg_hour_per_country_salary = data.groupby(['native-country','salary'], as_index = False) \
['hours-per-week'].mean().round(0)

avg_hour_per_country_salary.head()

  native-country salary  hours-per-week
0              ?  <=50K            40.0
1              ?   >50K            46.0
2       Cambodia  <=50K            41.0
3       Cambodia   >50K            40.0
4         Canada  <=50K            38.0

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответсвтуещей группы для каждого человека в новой колонке AgeGroup**

In [147]:
# your code

data['AgeGroup'] = data['age'].apply(lambda x: 'young' if 16<x<35 else 
                                              ('adult' if 35<=x<70 else 'retiree'))

data.AgeGroup.value_counts()

adult      17883
young      14049
retiree      629
Name: AgeGroup, dtype: int64

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [169]:
# your code
data[data['salary'] == '>50K'] \
.groupby(['AgeGroup'], as_index = False) \
.age.count() \
.rename(columns = {'age':'salary_above_50'}) \
.sort_values('salary_above_50', ascending = False) \
.head(1).AgeGroup.values

array(['adult'], dtype=object)

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [178]:
# your code

amount_of_people_per_occ = data.groupby(['occupation'], as_index = False) \
.age.count() \
.rename(columns = {'age':'amount_per_occ'})

amount_of_people_per_occ

           occupation  amount_per_occ
0                   ?            1843
1        Adm-clerical            3770
2        Armed-Forces               9
3        Craft-repair            4099
4     Exec-managerial            4066
5     Farming-fishing             994
6   Handlers-cleaners            1370
7   Machine-op-inspct            2002
8       Other-service            3295
9     Priv-house-serv             149
10     Prof-specialty            4140
11    Protective-serv             649
12              Sales            3650
13       Tech-support             928
14   Transport-moving            1597

In [197]:
def filter_func(occ_list):
    
    result = []
    
    for occ in occ_list:
        data_occ = data[data['occupation'] == occ]
    
        if data_occ['age'].mean() < 40 and (data_occ['hours-per-week'] > 5).all():
            result.append(occ)
            
        else: continue
        
    return result

In [200]:
occ_list = list(amount_of_people_per_occ.occupation.values)

filter_func(occ_list)

['Armed-Forces']